#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	const string m1[] = {
		"сто ","двести ","триста ",
		"четыреста ","пятьсот ","шестьсот ",
		"семьсот ","восемьсот ","девятьсот "
	};
	const string m2[] = {
		"двадцать ","тридцать ",
		"сорок ","пятьдесят ","шестьдесят ",
		"семьдесят ","восемьдесят ","девяносто "
	};
	const string m21[] = {
		"одиннадцать","двенадцать",
		"тринадцать","четырнадцать","пятнадцать",
		"шестнадцать","семнадцать","восемнадцать", "девятнадцать"
	};
	const string m3[] = {
		"один","два",
		"три","четыре","пять",
		"шесть","семь","восемь", "девять"
	};
	int A, i, j, k;
	cout << "Введите целое трехзначное число, программа выведет его в виде текста" << endl;
	cin >> A;
	i = A / 100;
	j = (A - i*100) / 10;
	k = A - i*100 - j*10;
    cout << m1[i - 1];
	if (j > 1) {
		cout << m2[j - 2];
		cout << m3[k - 1];
	}
	else if (j > 0) {
		cout << m21[j - 1];
	}
	else {
		cout << m3[k - 1];
	}
	return 0;
}