#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	const string m[] = {
		"января","февраля","марта",
		"апреля","мая","июня",
		"июля","августа","сентября",
		"октября","ноября","декабря"
	};
	const string n[] = {
		"первое ","второе ","третье ",
		"четвертое ","пятое ","шестое ",
		"седьмое ","восьмое ","девятое ",
		"десятое ","одинадцатое ","двенадцатое",
		"тринадцатое ","четырнадцатое ","пятнадцатое ",
		"шестнадцатое ","семнадцатое ","восемнадцатое ",
		"девятнадцатое ","двадцатое ","двадцать первое ",
		"двадцать второе ","двадцать третье ",
		"двадцать четвертое ","двадцать пятое ","двадцать шестое ",
		"двадцать седьмое ","двадцать восьмое ","двадцать девятое ",
		"тридцатое ","тридцать первое "
	};
	int i, j;
	cout << "введите номер дня – целое число от 1 до 31 и месяца — целое число в диапазоне 1–12 (1 — январь, 2 — февраль и т. д.). Программа выведет дату в виде текста (например, «пятое января»)." << endl;
	cout << "введите номер дня" << endl;
	cin >> i;
	cout << "введите номер месяца" << endl;
	cin >> j;
	cout << n[i-1] << m[j-1] << endl;
	return 0;
}